7zip
acpi_call
alsa-utils
amd-ucode
archlinuxcn-keyring
base
base-devel
bat
brightnessctl
btop
clang
direnv
dmidecode
efibootmgr
fastfetch
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-material-color
fcitx5-pinyin-zhwiki
fcitx5-qt
fcitx5-rime
fd
ffmpegthumbnailer
fish
fuse2
fuzzel
fzf
gdb
gdu
ghostty
git
glu
greetd
greetd-tuigreet
grub
imagemagick
lazygit
linux
linux-firmware
lsd
mako
man-db
man-pages
mesa
neovide
neovim
networkmanager
niri
noto-fonts-cjk
noto-fonts-emoji
npm
nwg-look
obsidian
openssh
pacman-contrib
papirus-icon-theme
paru
paru-debug
pavucontrol
pipewire-alsa
pipewire-pulse
polkit-gnome
rime-ice-git
ripgrep
rofi
rustup
sudo
swaybg
swayidle
telegram-desktop
terminus-font
tlp
tmux
tree
ttf-dejavu
ttf-lxgw-wenkai
ttf-maplemono-nf-cn-unhinted
ttf-sarasa-gothic
unarchiver
unzip
vlc
vulkan-radeon
waybar
wget
wireplumber
wl-clipboard
wqy-zenhei
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xorg-xwayland
xwayland-satellite
yazi
zathura
zathura-pdf-mupdf
zen-browser
zoxide
