7zip
acpi_call
alsa-utils
amd-ucode
arch-audit
archlinuxcn-keyring
base
base-devel
bat
bear
brightnessctl
btop
cataclysm-dda
cataclysm-dda-tiles
clang
cmake
direnv
dmidecode
docker
efibootmgr
fastfetch
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-material-color
fcitx5-pinyin-zhwiki
fcitx5-qt
fcitx5-rime
fd
ffmpegthumbnailer
fish
flatpak
fuse2
fuzzel
fzf
gdb
gdu
ghidra
ghostty
git
glu
goldendict-ng
grub
imagemagick
impala
iwd
jdk-openjdk
kanshi
lazygit
libva-utils
linux
linux-firmware
lsd
lshw
ly
mako
man-db
man-pages
mangohud
mesa
mpv
neovide
neovim
nethack
networkmanager
newsboat
nheko-git
niri
noto-fonts-cjk
noto-fonts-emoji
npm
nwg-look
openssh
pacman-contrib
papirus-icon-theme
paru
paru-debug
pavucontrol
pipewire-alsa
pipewire-pulse
polkit-gnome
pwndbg
python-hatchling
qt6ct
racket
rime-ice-git
ripgrep
rofi
steam
sudo
swaybg
swayidle
terminus-font
tlp
tmux
translate-shell
trash-cli
tree
ttf-dejavu
ttf-jetbrains-mono
ttf-lxgw-wenkai
ttf-maplemono-nf-cn-unhinted
ttf-sarasa-gothic
ttf-ubuntu-font-family
typst
unarchiver
unzip
usbmuxd
vulkan-radeon
waybar
wget
wireplumber
wl-clipboard
wqy-zenhei
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xorg-xwayland
xwayland-satellite
yazi
yt-dlp
zathura
zathura-pdf-mupdf
zeal
zen-browser
zotero
zoxide
